{
  "url": "https://management.nirmauni.ac.in/admission-aid/postgraduate/mba-and-mba-hrm",
  "title": "MBA in Ahmedabad - MBA Admissions Open for 2025 - IMNU",
  "content": "Title: MBA in Ahmedabad - MBA Admissions Open for 2025 - IMNU\n\n| Programme | Intake | NRI / NRI Sponsored Category | ACPC–State Quota Seats | Total Seats |\n| MBA | 180 | 45 | 75* | 300# |\n| MBA (HRM) | 18 | 5 | 7 | 30 |\n*Excluding Economically Weaker Sections (EWS)\n#Supernumerary Seats Over and above the Intake of 300seats and 30seats respectively, 15% (Supernumerary) seats are also allocated for admissions to Persons of Indian Origin, Foreign Nationals and Children of Indian Workers of Gulf Countries/South East Asia.\nA three-year bachelor’s degree (10+2+3) or equivalent in any discipline from a recognised university with at least 50% aggregate marks or equivalent CGPA.\nCandidates appearing in the final year of the Bachelor’s Degree can also apply, provided they furnish the proof of meeting the minimum eligibility criteria within 3 months of them joining the programme. They should have appeared in all the examinations of their graduation by the time of commencement of the programme. The candidates failing to meet the minimum eligibility criteria will be asked to withdraw from the programme. The tuition fee paid by such candidates will be forfeited unless such vacant seats are filled by other candidates.\nApplication and Entrance Test (Common Admission Test)\nEntrance Test:\nApplicants are required to appear for the Common Admission Test [CAT] conducted by Indian Institutes of Management (IIMs). The CAT examination conducted at different centres all over the country is likely to be held during the month of November (refer CAT Bulletin for further details). The candidates aspiring for admissions at the Institute of Management, Nirma University are required to apply to the Institute separately. For those candidates who have applied to the Institute, the Institute will receive the test scores from the IIM conducting the CAT examination.\nIIMs have no role either in the selection process or in the conduct of the programme.\nOnline Application Process:\nApplicants should complete the online application form with non-refundable admission processing fee of Rs. 1500/-. The payment should be made online by credit card/debit card/net banking.\nAll communications with regard to admission will be done online or through electronic mails, so the candidates are advised to keep track of the online information at our website and check emails provided in application form.\nCandidates shortlisted on the basis of their performance in different components of Common Admission Test will be called for Personal Interview and Theme Development & Presentation (TDP).\nNote: The Institute reserves the right to drop or add any interview centres.\nThe candidates will be finally selected for admission based on the candidates’ performance in the CAT, TDP, Personal Interview, Academic Performance in XII and graduation and work experience.\nThe following weightage will be given for each component of the selection criteria and composite scores will be computed based on the selection criteria.\n| Sub-Criteria | Weights |\n| Common Admission Test | 60% |\n| Personal Interview | 20% |\n| Theme Development & Presentation | 10% |\n| Academic Performance | 10% |\nAn additional score up to 10 points will be given for fulltime relevant work experience in a professional organization.\nWhile computing the score of the Academic Performance, the following weightage will be given for each component of the score of the Academic Performance.\n| Sub-Criteria | Weights |\n| Pre-Final Graduation* | 50% |\n| Class XII | 30% |\n| Class X | 20% |\n*only the aggregate marks obtained in the examinations upto pre-final year will be considered for computing the merit, for example in case of a 3-year degree programme first and second year examinations’ marks will be counted and in case a 4-year degree programme first, second and third year examinations’ marks will be counted.\nAdmission Offer:\nAdmissions will be offered as per the merits arrived, based on the composite score computed considering the above given admission criteria and the result will be announced on the Institute’s website. Successful candidates will be informed through the e-mail id provided in the application form. Offer letters will also be sent at the mailing address provided in the Application form. Applicants are, therefore, advised to check the updates on the website and their respective e-mail id at regular intervals. The Institute will not be responsible for non-receipt or delay of any communication which is sent to the candidate’s mailing address and email provided in the Admission Application forms.\nNote:\n| Fees | Amount |\n|---|---|\n| Tuition Fee | Rs. 6,40,000/- per annum [subject to revision by the Fee Regulatory Committee of Govt. of Gujarat] |\n| Hostel Fee* | Rs. 94,400/- + GST per annum (for Non AC twin sharing without attached washroom) (2025-26) |\n| Activity Fee | Rs. 15,000/- per annum |\n| Examination Fee | Rs. 11,000/- per annum |\nExpenses on food, books, reading material, handouts, printouts, medical insurance, electricity used in the hostel room, etc. will be charged separately.\nAdmissions to these seats can be secured through the Admission Committee for Professional Courses (ACPC, GoG). Candidate must apply to ACPC, GoG, separately. For eligibility and admission process, please visit the website of ACPC\nClick here for ACPC Website:MBA/MCA – Admission Committee for Professional Courses (ACPC), Gujarat\nA three-year bachelor’s degree (10+2+3) or equivalent in any discipline from a recognized university with at least 50% aggregate marks or equivalent CGPA.\nCandidates appearing in the final year of the Bachelor’s Degree can also apply provided they furnish the proof of meeting the minimum eligibility criteria within 3 months of joining the programme. They should have appeared in all the examinations of their graduation by the time of commencement of the programme. The candidates failing to meet the minimum eligibility criteria will be asked to withdraw from the programme. The tuition fee paid by such candidates will be forfeited unless such vacant seats are filled by other candidates.\nApplication and Entrance Test (Common Admission Test)\nEntrance Test:\nNRI Sponsored candidates are required to appear for the Common Admission Test [CAT] conducted by Indian Institutes of Management (IIMs). The CAT examination conducted at different centres all over the country likely to be held during the month of November [refer CAT Bulletin for further details at here]. The candidates aspiring for admissions at the Institute of Management, Nirma University are required to apply to the Institute separately. For those candidates who have applied to the Institute, the Institute will receive the test scores from the IIM conducting the CAT examination.\nIIMs have no role either in the selection process or in the conduct of the programme.\nForeign Nations/NRI/Person of Indian origin/Gulf Countries and South East Asia candidates can be considered for admission on the basis of their GMAT scores also.\nOnline Application Process:\nApplicants should complete the online application form with non-refundable admission processing fee of Rs. 4500/- under NRI/NRI Sponsored Category. The payment should be made online by credit card/debit card/net banking.\nProcedure to convert Applications under NRI Sponsored Category\nThe candidates who have applied for admission in General Category have an option to convert their Applications in NRI Sponsored Category.\nFor convert application, candidate need to login with existing credential and use option Add Category NRI/NRI Sponsored and make a payment of Rs. 4500/- through online by credit card/debit card/net banking.\nCandidates shortlisted on the basis of their performance in different components of Common Admission Test will be called for Personal Interview and Theme Development & Presentation (TDP). The Interview and TDP will be conducted at various centres across the country.\nNote: The Institute reserve the right to drop or add any interview centres.\nThe candidates will be finally selected for admission based on the candidates’ performance in the CAT, TDP, Personal Interview, Academic Performance in XII and graduation and work experience.\nThe following weightage will be given for each component of the selection criteria and composite scores will be computed based on the selection criteria.\n| Sub-Criteria | Weights |\n| Common Admission Test | 60% |\n| Personal Interview | 20% |\n| Theme Development & Presentation | 10% |\n| Academic Performance | 10% |\nAn additional score up to 10 points will be given for fulltime relevant work experience in a professional organization.\nWhile computing the score of the Academic Performance, the following weightage will be given for each component of the score of the Academic Performance.\n| Sub-Criteria | Weights |\n| Pre-Final Graduation* | 50% |\n| Class XII | 30% |\n| Class X | 20% |\n*only the aggregate marks obtained in the examinations upto pre-final year will be considered for computing the merit, for example in case of a 3-year degree programme first and second year examinations’ marks will be counted and in case a 4-year degree programme first, second and third year examinations’ marks will be counted.\nAdmission Offer:\nAdmissions will be offered as per the merits arrived, based on the composite score computed considering the above given admission criteria and the result will be announced on the Institute’s website. Successful candidates will be informed through the e-mail id provided in the application form. Offer letters will also be sent at the mailing address provided in the Application form. Applicants are, therefore, advised to check the updates on the website and their respective e-mail id at regular intervals. The Institute will not be responsible for non-receipt or delay of any communication which is sent to the candidate’s mailing address and email provided in the Admission Application forms.\nNote:\n| Fees | Amount |\n| NRI/NRI sponsored /Foreign Nationals /PIO Tuition Fee | US$ 30,000 or equivalent in Indian Rupees for the entire programme |\n| Hostel Fee* | Rs. 94, 400/- + GST per annum (for Non AC twin sharing without attached washroom) (2025-26) |\n| Student Development Advance | Rs. 15,000/- per annum |\n| Examination Fee | Rs. 11,000/- per annum |\nExpenses on food, books, reading material, handouts, printouts, medical insurance, electricity used in the hostel room, etc. will be charged separately.\nHostel Fee*: The fees mentioned above are the base fees. However, hostel fees vary depending on the type of room (AC/Non-AC, attached/not attached washroom, twin/triple sharing, etc.). The hostel fees cover only accommodation charges; food and laundry charges will be applicable separately. Please note that hostel fees are subject to revision without prior notice.\nNote:\n1. The tuition fee, approved by the fee fixation committee, Government of Gujarat, is subject to change based on the decision of the committee.\n2. The admission selection process is subject to the approval of the Government of Gujarat.\n3. The information provided here is pertaining to the current status and subject to change.\nOrder of the Fee Fixation Committee from Government of Gujarat\nThe international students can apply under one of the following two categories:\nCategory 1 : Foreign Nationals having non-Indian passports (FN), OR foreign students having non-Indian passport and also having the OCI or PIO card (OCI/PIO) can apply under OCI/PIO/FN Supernumerary category that has 10% seats reserved. The students from SAARC countries can apply under the FN category, however they will be charged the fees as per the Indian National regular fees.\nCategory 2 : Candidates whose parents are currently working in Gulf countries or South-east Asia can apply under CIWGC-SEA Supernumerary category that has 5% seats reserved. The students must hold Indian passports, and should have passed qualifying exams either from India or outside of India.\nMore details on number of seats, eligibility, fees, online application link etc. can be found from following website:\nDr Mehul R Naik\nHead International Relations\nNirma University\nS. G. Highway, Ahmedabad 382481, INDIA\nPhone: 917971652499\nEmail: ir.nu@nirmauni.ac.in\nA three-year bachelor’s degree (10+2+3) or equivalent in any discipline from a recognized University with at least 50% aggregate marks or equivalent CGPA.\nCandidates appearing in the final year of the Bachelor’s Degree can also apply provided they furnish the proof of meeting the minimum eligibility criteria within 3 months of joining the programme. They should have appeared in all the examinations of their graduation by the time of commencement of the Programme.\nThe candidates failing to meet the eligibility criteria will be asked to withdraw from the programme. The tuition fee paid by such candidates will be forfeited unless such vacant seats are filled by other candidates.\nApplication and Entrance Test (Common Admission Test)\nEntrance Test:\nApplicants are required to appear for the Common Admission Test [CAT] conducted by Indian Institutes of Management (IIMs). The CAT examination conducted at different centres all over the country likely to be held during the month of November [refer CAT Bulletin for further details]. The candidates aspiring for admissions at the Institute of Management, Nirma University are required to apply to the Institute separately. For those candidates who have applied to the Institute, the Institute will receive the test scores from the IIM conducting the CAT examination.\nIIMs have no role either in the selection process or in the conduct of the programme.\nFurther, Foreign Nation/Person of Indian origin/Gulf Countries and South Est Asia candidates can be considered for admission on the basis of their GMAT scores [not taken before July 2021].\nOnline Application Process:\nMore details and online application link etc. can be found from following website:\nCandidates shortlisted on the basis of their performance in different components of Common Admission Test will be called for Personal Interview and Theme Development & Presentation (TDP). The Interview and TDP will be conducted at various centers across the country.\nNote: The Institute reserve the right to drop or add any interview centers.\nThe candidates will be finally selected for admission based on the candidates’ performance in the CAT, TDP, Personal Interview, Academic Performance in XII and graduation and work experience.\nThe following weightage will be given for each component of the selection criteria and composite scores will be computed based on the selection criteria.\n| Sub-Criteria | Weights |\n| Common Admission Test | 60% |\n| Personal Interview | 20% |\n| Theme Development & Presentation | 10% |\n| Academic Performance | 10% |\nAn additional score up to 10 points will be given for fulltime relevant work experience in a professional organization.\nWhile computing the score of the Academic Performance, the following weightage will be given for each component of the score of the Academic Performance.\n| Sub-Criteria | Weights |\n| Pre-Final Graduation* | 50% |\n| Class XII | 30% |\n| Class X | 20% |\n*only the aggregate marks obtained in the examinations upto pre-final year will be considered for computing the merit, for example in case of a 3-year degree programme first and second year examinations’ marks will be counted and in case a 4-year degree programme first, second and third year examinations’ marks will be counted.\nAdmission Offer:\nAdmissions will be offered as per the merits arrived, based on the composite score computed considering the above given admission criteria and the result will be announced on the Institute’s website. Successful candidates will be informed through the e-mail id provided in the application form. Offer letters will also be sent at the mailing address provided in the Application form. Applicants are, therefore, advised to check the updates on the website and their respective e-mail id at regular intervals. The Institute will not be responsible for non-receipt or delay of any communication which is sent to the candidate’s mailing address and email provided in the Admission Application forms.\nNote:\n| Fees | Amount |\n|---|---|\n| Gulf and South East Asia (CIWGC-SEA) Tuition Fee | US$ 22,000 or equivalent in Indian Rupees for the entire programme |\n| Hostel Fee | Rs. 94,400+ GST per annum(for Non AC twin sharing without attached washroom) (2025-26) |\n| Student Development Advance | Rs. 15,000/- per annum |\n| Examination Fee | Rs. 11,000/- per annum |\nTo encourage and help the meritorious students on the basis of merit and merit-cum-means, the University has decided to provide the scholarships as under:\n| All India Category |\nAdmitted through ACPC |\nAmount (Rs) per annum |\n| Top 20 Students | Top 10 Students | Rs. 1,00,000/- each |\nImportant note: The student shall be entitled to get benefit of scholarship under any one of the above mentioned categories subject to fulfilment of eligibility criteria.\nEligibility criteria for continuation/ renewal of the scholarship\nContinuation/Renewal of the Scholarship in the subsequent years will be as per the University policy which may differ on a semester/year basis. However, it will be subject to meeting of minimum eligibility criteria, as under:\n1. During the entire previous year, the conduct of the student should be good\n2. No acts or omission which results in unlawful behavior, malafide intention maligning the University brand in digital, print, or social media, promoting, supporting or sharing any content which is against the University brand\n3. No disciplinary action was initiated/sanctioned against the student under the student handbook or compliance with norms as prescribed by the University\n4. The student should maintain merit and get CGPA of 7.0 and above and should have passed all courses of study in the first attempt in the previous year\n5. The student is not caught in unfair means in any of the examinations conducted either by the Institute or University\n6. The student should maintain minimum attendance criteria except the absence with genuine reasons for which the permission of the Ho I was obtained particularly in the case of illness\n7. It will be the responsibility of the applicant to check the eligibility before submitting application. In case the applicant is found non-eligible at any stage, his/her submission or scholarship will be disqualified\nThe students admitted under Non-Resident Indian (NRI)/NRI sponsored, Persons of Indian Origin (PIO), Foreign Nationals (FN) or Children of Indian Workers in Gulf Countries (CIWGC) category are not be eligible for the above scholarships.\nThe President will have power to make any exception in the above rules framed. However, in case of doubt in interpretation of any clause, the decision of the President will be final.\n| Details | All India Category | Admitted through ACPC | Amount (Rs) per annum |\n| 25 students whose parents’ total annual income is 4 lakh or less | 17 students |\n8 students |\nRs. 1,00,000/- each |\n| another 38 students whose parents’ total annual income is 8 lakh or less | 25 students |\n13 students |\nRs. 50,000/- each |\nImportant note: The student shall be entitled to get benefit of scholarship under any one of the above mentioned categories subject to fulfilment of eligibility criteria.\nEligibility criteria for continuation/ renewal of the scholarship\nContinuation/Renewal of the Scholarship in the subsequent years will be as per the University policy which may differ on a semester/year basis. However, it will be subject to meeting of minimum eligibility criteria, as under:\n1. During the entire previous year, the conduct of the student should be good\n2. No acts or omission which results in unlawful behavior, malafide intention maligning the University brand in digital, print, or social media, promoting, supporting or sharing any content which is against the University brand\n3. No disciplinary action was initiated/sanctioned against the student under the student handbook or compliance with norms as prescribed by the University\n4. The student should maintain merit and get CGPA of 7.0 and above and should have passed all courses of study in the first attempt in the previous year\n5. The student is not caught in unfair means in any of the examinations conducted either by the Institute or University\n6. The student should maintain minimum attendance criteria except the absence with genuine reasons for which the permission of the Ho I was obtained particularly in the case of illness\n7. It will be the responsibility of the applicant to check the eligibility before submitting application. In case the applicant is found non-eligible at any stage, his/her submission or scholarship will be disqualified\nThe students admitted under Non-Resident Indian (NRI)/NRI sponsored, Persons of Indian Origin (PIO), Foreign Nationals (FN) or Children of Indian Workers in Gulf Countries (CIWGC) category are not be eligible for the above scholarships.\nThe President will have power to make any exception in the above rules framed. However, in case of doubt in interpretation of any clause, the decision of the President will be final.\n| Details | All India Category | Admitted through ACPC | Amount (Rs) per annum |\n| students having undergraduate degree in Engineering Degree and obtained a CAT score of 85 percentile and above | All eligible students, admitted under both All-India category and through ACPC taken together | Rs. 1,00,000/- each |\nImportant note: The student shall be entitled to get benefit of scholarship under any one of the above mentioned categories subject to fulfilment of eligibility criteria.\nEligibility criteria for continuation/ renewal of the scholarship\nContinuation/Renewal of the Scholarship in the subsequent years will be as per the University policy which may differ on a semester/year basis. However, it will be subject to meeting of minimum eligibility criteria, as under:\n1. During the entire previous year, the conduct of the student should be good\n2. No acts or omission which results in unlawful behavior, malafide intention maligning the University brand in digital, print, or social media, promoting, supporting or sharing any content which is against the University brand\n3. No disciplinary action was initiated/sanctioned against the student under the student handbook or compliance with norms as prescribed by the University\n4. The student should maintain merit and get CGPA of 7.0 and above and should have passed all courses of study in the first attempt in the previous year\n5. The student is not caught in unfair means in any of the examinations conducted either by the Institute or University\n6. The student should maintain minimum attendance criteria except the absence with genuine reasons for which the permission of the Ho I was obtained particularly in the case of illness\n7. It will be the responsibility of the applicant to check the eligibility before submitting application. In case the applicant is found non-eligible at any stage, his/her submission or scholarship will be disqualified\nThe students admitted under Non-Resident Indian (NRI)/NRI sponsored, Persons of Indian Origin (PIO), Foreign Nationals (FN) or Children of Indian Workers in Gulf Countries (CIWGC) category are not be eligible for the above scholarships.\nThe President will have power to make any exception in the above rules framed. However, in case of doubt in interpretation of any clause, the decision of the President will be final.\nVidya Lakshmi is a first of its kind portal for students seeking Education Loan. This portal has been developed under the guidance of the Department of Financial Services, (Ministry of Finance), the Department of Higher Education (Ministry of Human Resource Development) and the Indian Banks Association (IBA). The portal has been developed and being maintained by NSDL e-Governance Infrastructure Limited. Students can view, apply and track the education loan applications to banks anytime, anywhere by accessing the portal. The portal also provides linkages to National Scholarship Portal.\nFor more details click on Vidya lakshmi\nRefund Policy:\nFor cancellation requests received on or before May 31, 2026, full amount after a deduction of Rs. 1000/- will be refunded within 15 to 20 days of the request.\n\n--- Extracted Tables ---\n\nTable 1:\nProgramme | Intake | NRI / NRI Sponsored Category | ACPC–State Quota Seats | Total Seats | MBA | 180 | 45 | 75* | 300# | MBA (HRM) | 18 | 5 | 7 | 30\n\nTable 2:\nFees | Amount | Tuition Fee | Rs. 6,40,000/- per annum [subject to revision by the Fee Regulatory Committee of Govt. of Gujarat] | Hostel Fee* | Rs. 94,400/- + GST per annum (for Non AC twin sharing without attached washroom) (2025-26) | Activity Fee | Rs. 15,000/- per annum | Examination Fee | Rs. 11,000/- per annum\n\nTable 3:\nFees | Amount | NRI/NRI sponsored /Foreign Nationals /PIO Tuition Fee | US$ 30,000 or equivalent in Indian Rupees for the entire programme | Hostel Fee* | Rs. 94, 400/- + GST per annum (for Non AC twin sharing without attached washroom) (2025-26) | Student Development Advance | Rs. 15,000/- per annum | Examination Fee | Rs. 11,000/- per annum\n\nTable 4:\nFees | Amount | Gulf and South East Asia (CIWGC-SEA) Tuition Fee | US$ 22,000 or equivalent in Indian Rupees for the entire programme | Hostel Fee | Rs. 94,400+ GST per annum(for Non AC twin sharing without attached washroom) (2025-26) | Student Development Advance | Rs. 15,000/- per annum | Examination Fee | Rs. 11,000/- per annum",
  "structured_data": {
    "tables": [
      "Programme | Intake | NRI / NRI Sponsored Category | ACPC–State Quota Seats | Total Seats | MBA | 180 | 45 | 75* | 300# | MBA (HRM) | 18 | 5 | 7 | 30",
      "Fees | Amount | Tuition Fee | Rs. 6,40,000/- per annum [subject to revision by the Fee Regulatory Committee of Govt. of Gujarat] | Hostel Fee* | Rs. 94,400/- + GST per annum (for Non AC twin sharing without attached washroom) (2025-26) | Activity Fee | Rs. 15,000/- per annum | Examination Fee | Rs. 11,000/- per annum",
      "Fees | Amount | NRI/NRI sponsored /Foreign Nationals /PIO Tuition Fee | US$ 30,000 or equivalent in Indian Rupees for the entire programme | Hostel Fee* | Rs. 94, 400/- + GST per annum (for Non AC twin sharing without attached washroom) (2025-26) | Student Development Advance | Rs. 15,000/- per annum | Examination Fee | Rs. 11,000/- per annum",
      "Fees | Amount | Gulf and South East Asia (CIWGC-SEA) Tuition Fee | US$ 22,000 or equivalent in Indian Rupees for the entire programme | Hostel Fee | Rs. 94,400+ GST per annum(for Non AC twin sharing without attached washroom) (2025-26) | Student Development Advance | Rs. 15,000/- per annum | Examination Fee | Rs. 11,000/- per annum"
    ]
  }
}