{
  "url": "https://pharmacy.nirmauni.ac.in/visitors/about-ahmedabad/",
  "title": "About Ahmedabad - Institute of Pharmacy",
  "content": "Title: About Ahmedabad - Institute of Pharmacy\n\nThe city of Ahmedabad, the seventh largest metropolis in India and the largest in the state of Gujarat, was founded in 1411 AD as a walled city on the eastern bank of the river Sabarmati.\nHistorically Ahmedabad has been one of the most important centres of trade and commerce in western India. It is also a major industrial and financial city, contributing about 14% of the total investments in all stock exchanges in India and 60% of the total productivity of the state.\nIt is the home of several scientific and educational institutions of national, regional and global importance. The city has a great architectural tradition reflected in many exquisite monuments, temples and modern buildings. Ahmedabad is the first Indian city to receive UNESCO’s World Heritage City Status in the year 2017.\nWeather\nAhmedabad has a tropical monsoon climate, which is hot and dry, except in the rainy season.\nSummer days are very hot with mean maximum temperature of 41.3°C, while nights are pleasant with mean minimum temperature of 26.3°C. The mean maximum and minimum temperatures in winter are 30°C and 15.4°C, respectively. The average annual rainfall of the area is 782 mm. The average relative humidity is 60% with a maximum of 80% to 90% during the rainy season.\nCulture\nAhmedabad enjoys a thriving cultural tradition, being the centre of Gujarati cultural activities and diverse traditions of different ethnic and religious communities. Popular celebrations and observances include Uttarayan – an annual kite-flying day on 14 January. The nine nights of Navratri are celebrated with people performing Garba – the folk dance of Gujarat. Other festivals such as Deepavali, Holi, Eid ul-Fitr and Christmas are celebrated with equal enthusiasm. The annual Rath Yatra procession on the Ashadh-sud-bij date of the Hindu calendar and the procession of Tajia during the Muslim holy month of Muharram are integral parts of the city’s composite culture.\nAhmedabad as an Industrial hub\nAhmedabad is one of the biggest exporters of jewellery and gems in India and also the largest among denim suppliers in the country.\nThe mainstay of the city’s economy is the textile industry. Its other important components are: pharmaceuticals and chemicals. Two of the biggest pharmaceutical companies of India – Zydus Cadila and Torrent Pharmaceuticals are based here.\nThe city houses the corporate headquarters of the Nirma Group of Industries, Adani Group, Rasna, Wagh Bakri, Intas Pharmaceuticals and Paras Pharmaceuticals.\nAbout Gandhinagar\nGandhinagar, the capital of Gujarat State is one of the greenest capital city in the world. The Infocity in Gandhinagar, an IT park project is strategically developed on a 24/7 work culture, on a principal location spread across 150 acres while the mega project of GIFT city (Gujarat International Finance-Tech City) has embarked to be devised as a global financial and IT services hub. The GIFT city is a business district promoted by the Government of Gujarat through a joint venture company. GIFT City is India’s first operational smart city in the Ahmedabad metropolitan region and international financial services centre. Gandhinagar also hosts a number of educational institutes of national and international reputation.\nOther Statistics\n| Co-ordinates | 23.03° N 72.58° E |\n| Area | 466 Sq.km. (year 2006) |\n| Population | 55,77,940 (year 2011 Census) |\n| Density | 11,948 /sq.km |\n| Literacy Rate | 89.60 % |\n| Average Annual Rainfall | 782 mm |\n| Popularly known as | Amdavad |\n| STD Code | 079 |",
  "structured_data": {
    "tables": []
  }
}