{
  "url": "https://pharmacy.nirmauni.ac.in/disclaimer/",
  "title": "Disclaimer - Institute of Pharmacy",
  "content": "Title: Disclaimer - Institute of Pharmacy\n\nBy accessing or using or observing this website, you agree to the applicability of our Terms of Use and Conditions (“Terms of Use”) and you are aware of the things we have disclaimed in here and have or may not in future conflict on the same.\nGeneral:\nAll information contained in or accessed through this website are provided on an “as is” and “as available” basis. No warranty of any kind, implied, express or statutory (including but not limited to, warranties of title, merchantability, satisfactory quality, non-infringement of third-party intellectual property right fitness for a particular purpose, warranties of performance and freedom from computer virus and other malicious code), is given in conjunction with such information, the veracity, accuracy, adequacy, completeness or reasonableness thereof, or of this website (Nirma University) in general. The information and materials are subject to change at any time without notice.\nLegal Disclaimers\nNirma University has not reviewed any or all of the web sites linked to its Web Site and is not responsible for the content of any off-site pages or any other web sites linked to the Web Site. Please understand that any non Nirma University web site is independent from Nirma University and Nirma University has no control over the content on that web site. In addition, a link to a non- Nirma University web site does not mean that Nirma University endorses or accepts any responsibility for the content, or the use, of such site. It is the user’s responsibility to take precautions to ensure that whatever is selected is free of such items as viruses, worms, Trojan horses and other items of a destructive nature. The contents so presented are subject to imperfection in themselves.\nThe information presented or undertaken to be published through this website may not be of the same veracity and may vary on the facts. The opinions or comments or suggestions so presented are to be of no liability on the website Nirma University as publishers or presenters of the same and the idea or opinions or comments or suggestions so presented would be the mere opinion of the writer or Author and has not to do with the conditions or objects or existence of any entity and personality may it be human or business or legal or not for profit and or government or non-government or public welfare?s reputation or performance in common. Such opinions or comments or suggestions so presented shall not bring any legally adverse relation of this website Nirma University to any of such entity and personality.\nThe information presented or provided through the website Nirma University shall not be used against any person and the personal details of the person if there by used against any such person, in the same situation the right to prosecute and to challenge the same with the person who has been put to danger or at an undesirable situation, in joint or on behalf of such person this right can be assessed as per the discretion of the Administrator and website managers.\nThe information on the Web Site may contain technical inaccuracies or typographical errors. Any information on the Web Site including contents, terms and conditions may be changed or updated by Nirma University without notice. User is bound by such revisions and should therefore periodically visit website to review the then current contents, information, terms and conditions etc. Some information that Nirma University publishes on the Website may contain references or cross references to Nirma University specifications, projects, programs and services that are not announced or available in your country. Such references do not imply that Nirma University intends to announce such specifications, projects, programs or services in your country.",
  "structured_data": {
    "tables": []
  }
}