{
  "url": "https://pharmacy.nirmauni.ac.in/about/about-pharmacy/overview/",
  "title": "Overview - Institute of Pharmacy",
  "content": "Title: Overview - Institute of Pharmacy\n\nThe Institute of Pharmacy was established in the year 2003 under Nirma University to develop competent professionals in the field of pharmaceutical sciences.\nIn a short span of period, it has become one of the leading institutions in the country, offering pharmaceutical education at the undergraduate, postgraduate, doctoral and postdoctoral levels.\nThe Institute has shown its presence at the national level by being ranked 5th in National Institutional Ranking Framework (NIRF) by the Ministry of Human Resource and Development (MHRD), Government of India in the year 2016 and for subsequent years also, Institute has maintained its ranking in the top 40 institutes.\nThe Institute has received grants of more than Rs 95 million from various government agencies, such as BRNS, RSSDI, DST, DBT, ICMR, SAC-ISRO, AYUSH, GSBTM and GUJCOST for research and development. The DST-FIST grant worth Rs 5.5 million for the purposes of infrastructure development was awarded to the Institute for the years 2015-2020.\nThe Institute houses state-of-the-art instruments, like Freeze dryer, Laminar air flow unit, BOD incubator, Gel Documentation System, Thermal cycler, Bio Monocular Inverted Microscope, Convulsiometer, Analgesiometer, Langendroff’s assembly, Rotary tablet machine, Refrigerated centrifuge, Florescent microscope, Twin Chamber Type Incinerator, Automatic Titrator, Photo stability Chamber, Brookfield viscometer, Mini spray drier, supercritical fluid extractor and chromatogram, HPTLC, HPLC, MPLC, GC, Fluorescence Spectrometer, Raman Spectrometer, UV Spectrophotometer, FTIR, ELISA, PCR, Electrophoresis, Texture Analyser, Automated Dissolution Apparatus, Extruder-Spheronizer, Multiple diffusion Assembly, High Pressure Homogenizer, Particle Size Analyser, Microwave synthesizer and stereotaxic apparatus with Microdialysis. The Institute also has software like Sybyl X, iWorx, Gold Suit, eCTD, Design Expert, etc.\nThe Institute also has a cell culture facility which provides all the basic and advanced equipments required for the culturing of mammalian cells. The facility enables students to work with primary and secondary cell lines. The expertise of in-house faculty members and regular interactive sessions with national and international experts through workshops, conferences make the most of it for the young-minds of the Institute and other organizations in advancing their research.\nThe Institute has a two-storied animal house facility registered with the Committee for Control and Supervision of Experiments on Animals (CPCSEA), Government of India. Besides, there is also a medicinal plant garden “Nirma Herbal Wealth”, having an area of 3356.5 sqm with around 150 genera and 500 plants.\nMeaning in English -“From ignorance, lead us to truth”\nThe Motto of the University has been taken from Brhadaranyaka Upanishad – I.III.28. The second line of the Pavamana Mantra explains how to lead life towards knowledge from ignorance which obscures our mind in understanding the reality. As the only remedy from darkness is light, the only remedy from ignorance is knowledge.\nStriving to excel in pharmaceutical education, research & innovation to develop outstanding professionals catering to the health care needs of the human kind.\nThe institute aims to develop employable students, researchers and entrepreneurs by inculcating critical thinking, problem-solving ability, ethical values and leadership skills. Institute provides a vibrant environment for continuous learning by strengthening industrial collaboration for developing competent professionals.\nStudent Centricity\nContribution to the Society\nQuest for Academic Excellence\nया कुन्देन्दुतुषारहारधवला या शुभ्रवस्त्रावृता\nया वीणावरदण्डमण्डितकरा या श्वेतपद्मासना।\nया ब्रह्माच्युत शंकरप्रभृतिभिर्देवैः सदा वन्दिता\nसा मां पातु सरस्वती भगवती निःशेषजाड्यापहा\nMeaning – Salutations to Devi Saraswati, Who is pure white like Jasmine, with the coolness of Moon, brightness of Snow and shine like the garland of Pearls; and Who is covered with pure white garments, Whose hands are adorned with Veena (a stringed musical instrument) and the boon-giving staff; and Who is seated on pure white Lotus, Who is always adored by Lord Brahma, Lord Acyuta (Lord Vishnu), Lord Shankara and other Devas, O Goddess Saraswati, please protect me and remove my ignorance completely.\nश्लोक अर्थ – जो विद्या की देवी भगवती सरस्वती कुन्द के फूल, चन्द्रमा, हिमराशि और मोती के हार की तरह धवल वर्ण की हैं और जो श्वेत वस्त्र धारण करती हैं, जिनके हाथ में वीणा-दण्ड शोभायमान है, जिन्होंने श्वेत कमलों पर आसन ग्रहण किया है तथा ब्रह्मा, विष्णु एवं शंकर शङ्कर आदि देवताओं द्वारा जो सदा पूजित हैं, वही सम्पूर्ण जड़ता और अज्ञान को दूर कर देने वाली माँ सरस्वती हमारी रक्षा करें।\nInstitute of Pharmacy follows outcome-based education to develop the requisite knowledge, skills, attitudes and habits of students. The purpose of the teaching-learning process at the institute is student – centric. Thus, the institution endeavors to promote student-centered learning.\nEach programme has its programme learning outcomes that are derived after consultation with all stakeholders, benchmarking and intensive internal discussions. Then, course learning outcomes are developed on the basis of programme outcomes. The course content and assessment are based on the course learning outcomes. Each programme has mechanisms for the assurance of learning. For example, the rubrics are developed on the basis of course learning outcomes and various assessment mechanisms are developed to assess the level of learning among students. Finally, assurance of learning results in an improvement in the teaching-learning process.\nContinuous evaluation of learning is followed at the institute. Efforts are made to measure cognitive as well as applied learning. Project work, quiz, problem-solving exercise, midterm examination, semester-end examination, Laboratory Practical work, industrial training, hospital training, drug store internship etc. constitute the different components of the overall assessment. Tutorials are also a part of the curriculum for one-to-one discussion. Moreover, students are provided feedback on their work to improve their academic performance. To maintain the transparency of the assessment system students are shown their assessed answer sheets and are allowed to discuss their scholastic performance with the faculty.\nProject-based learning is another salient feature of the teaching-learning process. These courses are supervised by and students are given sufficient support by faculty to apply their learning in solving practical problems of pharmaceutical science.\nCurriculum and course upgradation is a continuous process. Its purpose is basically to enhance the learning of students. Therefore, we modify and upgrade the curriculum and courses from time to time to provide the latest knowledge and skills to our students.",
  "structured_data": {
    "tables": []
  }
}